bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA3250P.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART0">
                <register caption="USART I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
                    <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC0"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
                    <bitfield caption="Data OverRun" mask="0x08" name="DOR0"/>
                    <bitfield caption="USART Parity Error" mask="0x04" name="UPE0"/>
                    <bitfield caption="Double the USART Transmission Speed" mask="0x02" name="U2X0"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
                    <bitfield caption="USART Data Register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="QFP_100">
            <pin pad="NC" position="1"/>
            <pin pad="PE0" position="2"/>
            <pin pad="PE1" position="3"/>
            <pin pad="PE2" position="4"/>
            <pin pad="PE3" position="5"/>
            <pin pad="PE4" position="6"/>
            <pin pad="PE5" position="7"/>
            <pin pad="PE6" position="8"/>
            <pin pad="PE7" position="9"/>
            <pin pad="VCC" position="10"/>
            <pin pad="GND" position="11"/>
            <pin pad="NC" position="12"/>
            <pin pad="PJ0" position="13"/>
            <pin pad="PJ1" position="14"/>
            <pin pad="NC" position="15"/>
            <pin pad="NC" position="16"/>
            <pin pad="NC" position="17"/>
            <pin pad="NC" position="18"/>
            <pin pad="PB0" position="19"/>
            <pin pad="PB1" position="20"/>
            <pin pad="PB2" position="21"/>
            <pin pad="PB3" position="22"/>
            <pin pad="PB4" position="23"/>
            <pin pad="PB5" position="24"/>
            <pin pad="PB6" position="25"/>
            <pin pad="PB7" position="26"/>
            <pin pad="NC" position="27"/>
            <pin pad="PG3" position="28"/>
            <pin pad="PG4" position="29"/>
            <pin pad="PG5" position="30"/>
            <pin pad="VCC" position="31"/>
            <pin pad="GND" position="32"/>
            <pin pad="XTAL2" position="33"/>
            <pin pad="XTAL1" position="34"/>
            <pin pad="NC" position="35"/>
            <pin pad="NC" position="36"/>
            <pin pad="PJ2" position="37"/>
            <pin pad="PJ3" position="38"/>
            <pin pad="PJ4" position="39"/>
            <pin pad="PJ5" position="40"/>
            <pin pad="PJ6" position="41"/>
            <pin pad="NC" position="42"/>
            <pin pad="PD0" position="43"/>
            <pin pad="PD1" position="44"/>
            <pin pad="PD2" position="45"/>
            <pin pad="PD3" position="46"/>
            <pin pad="PD4" position="47"/>
            <pin pad="PD5" position="48"/>
            <pin pad="PD6" position="49"/>
            <pin pad="PD7" position="50"/>
            <pin pad="PG0" position="51"/>
            <pin pad="PG1" position="52"/>
            <pin pad="PC0" position="53"/>
            <pin pad="PC1" position="54"/>
            <pin pad="PC2" position="55"/>
            <pin pad="PC3" position="56"/>
            <pin pad="PC4" position="57"/>
            <pin pad="PC5" position="58"/>
            <pin pad="NC" position="59"/>
            <pin pad="NC" position="60"/>
            <pin pad="NC" position="61"/>
            <pin pad="NC" position="62"/>
            <pin pad="PH0" position="63"/>
            <pin pad="PH1" position="64"/>
            <pin pad="PH2" position="65"/>
            <pin pad="PH3" position="66"/>
            <pin pad="NC" position="67"/>
            <pin pad="PC6" position="68"/>
            <pin pad="PC7" position="69"/>
            <pin pad="PG2" position="70"/>
            <pin pad="PA7" position="71"/>
            <pin pad="PA6" position="72"/>
            <pin pad="PA5" position="73"/>
            <pin pad="PA4" position="74"/>
            <pin pad="PA3" position="75"/>
            <pin pad="PA2" position="76"/>
            <pin pad="PA1" position="77"/>
            <pin pad="PA0" position="78"/>
            <pin pad="NC" position="79"/>
            <pin pad="VCC" position="80"/>
            <pin pad="GND" position="81"/>
            <pin pad="NC" position="82"/>
            <pin pad="NC" position="83"/>
            <pin pad="PH4" position="84"/>
            <pin pad="PH5" position="85"/>
            <pin pad="PH6" position="86"/>
            <pin pad="PH7" position="87"/>
            <pin pad="NC" position="88"/>
            <pin pad="NC" position="89"/>
            <pin pad="PF7" position="90"/>
            <pin pad="PF6" position="91"/>
            <pin pad="PF5" position="92"/>
            <pin pad="PF4" position="93"/>
            <pin pad="PF3" position="94"/>
            <pin pad="PF2" position="95"/>
            <pin pad="PF1" position="96"/>
            <pin pad="PF0" position="97"/>
            <pin pad="AREF" position="98"/>
            <pin pad="AGND" position="99"/>
            <pin pad="AVCC" position="100"/>
        </pinout>
    </pinouts>
</target-description-file>
